app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)
    if @article.save
---
INSERT INTO `articles` (`title`, `text`, `created_at`, `updated_at`) VALUES ('sfsfssdf', 'sdfsdf', '2017-11-27 10:45:32', '2017-11-27 10:45:32')