app/controllers/basket_controller.rb

  def index
  @baskets = Basket.all
---
SELECT `baskets`.* FROM `baskets`