app/controllers/basket_detail_controller.rb

SELECT `basket_details`.`id` FROM `basket_details`
---
  def index
    @basket_detail = BasketDetail.all

SELECT  `products`.* FROM `products` WHERE `products`.`name_product` = 'drabina 2x2' AND `products`.`brutto_price` = 212.0 LIMIT 1
INSERT INTO `baskets` (`basket_fv`, `total_price`) VALUES ('9', 9.0)
INSERT INTO `basket_details` (`basket_id`, `product_id`) VALUES (2, 2)
INSERT INTO `products` (`name_product`, `brutto_price`) VALUES ('Drabina 3x14', 349.0)
---
  def create
    @product_detail = Product.new(b_params)
    @basket = Basket.new(a_params)
    if @z = Product.find_by(name_product: @product_detail.name_product, brutto_price: @product_detail.brutto_price)
      if @basket.save
        @b = @basket.id
        @a = @product_detail.id
        @basket_detail = BasketDetail.new(basket_id: @b, product_id: @z.id)

        if @basket_detail.save