app/controllers/basket_detail_controller.rb

  def index
    @basket_detail = Basket.all
    @basket_detail = Product.all
    @basket_detail = BasketDetail.all
    @basket_detail = @basket_detail.joins(:basket)
---
SELECT `basket_details`.* FROM `basket_details` INNER JOIN `baskets` ON `baskets`.`id` = `basket_details`.`basket_id` INNER JOIN `products` ON `products`.`id` = `basket_details`.`product_id`