app/controllers/users_controller.rb

  def show
    @users = User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 0 LIMIT 1

  def create
    @users = User.new(user_params)
    if @users.save
---
INSERT INTO `users` (`username`, `email`, `password`, `password_confirmation`, `created_at`, `updated_at`) VALUES ('pawel', 'aad@tlen.pl', 1, 1, '2017-11-27 22:50:50', '2017-11-27 22:50:50')