app/views/basket_detail/new.html.erb

SELECT  `products`.* FROM `products` WHERE `products`.`name_product` = 'drabina 2x2' AND `products`.`id` = 1 LIMIT 1
---
      <%= form.label :name_product %><br>
      <%= form.collection_select(:name_product, Product.all, :name_product, :name_product, {multiple: true}) %>